Day-11/piece-1/k6-output.txt
k6 run --env BASE_URL=http://localhost:5075 k6/load-test.js 2>&1 | tee k6-baseline.txt

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: k6/load-test.js
        output: -

     scenarios: (100.00%) 2 scenarios, 40 max VUs, 1m35s max duration (incl. graceful stop):
              * slow_scenario: 20 looping VUs for 30s (exec: slowTest, gracefulStop: 30s)
              * fast_scenario: 20 looping VUs for 30s (exec: fastTest, startTime: 35s, gracefulStop: 30s)


running (0m01.0s), 20/40 VUs, 0 complete and 0 interrupted iterations
slow_scenario   [   3% ] 20 VUs   01.0s/30s
fast_scenario • [   0% ] waiting  34.0s

running (0m02.0s), 20/40 VUs, 0 complete and 0 interrupted iterations
slow_scenario   [   7% ] 20 VUs   02.0s/30s
fast_scenario • [   0% ] waiting  33.0s

running (0m03.0s), 20/40 VUs, 0 complete and 0 interrupted iterations
slow_scenario   [  10% ] 20 VUs   03.0s/30s
fast_scenario • [   0% ] waiting  32.0s

running (0m04.0s), 20/40 VUs, 20 complete and 0 interrupted iterations
slow_scenario   [  13% ] 20 VUs   04.0s/30s
fast_scenario • [   0% ] waiting  31.0s

running (0m05.0s), 20/40 VUs, 20 complete and 0 interrupted iterations
slow_scenario   [  17% ] 20 VUs   05.0s/30s
fast_scenario • [   0% ] waiting  30.0s

running (0m06.0s), 20/40 VUs, 20 complete and 0 interrupted iterations
slow_scenario   [  20% ] 20 VUs   06.0s/30s
fast_scenario • [   0% ] waiting  29.0s

running (0m07.0s), 20/40 VUs, 22 complete and 0 interrupted iterations
slow_scenario   [  23% ] 20 VUs   07.0s/30s
fast_scenario • [   0% ] waiting  28.0s

running (0m08.0s), 20/40 VUs, 40 complete and 0 interrupted iterations
slow_scenario   [  27% ] 20 VUs   08.0s/30s
fast_scenario • [   0% ] waiting  27.0s

running (0m09.0s), 20/40 VUs, 40 complete and 0 interrupted iterations
slow_scenario   [  30% ] 20 VUs   09.0s/30s
fast_scenario • [   0% ] waiting  26.0s

running (0m10.0s), 20/40 VUs, 40 complete and 0 interrupted iterations
slow_scenario   [  33% ] 20 VUs   10.0s/30s
fast_scenario • [   0% ] waiting  25.0s

running (0m11.0s), 20/40 VUs, 60 complete and 0 interrupted iterations
slow_scenario   [  37% ] 20 VUs   11.0s/30s
fast_scenario • [   0% ] waiting  24.0s

running (0m12.0s), 20/40 VUs, 60 complete and 0 interrupted iterations
slow_scenario   [  40% ] 20 VUs   12.0s/30s
fast_scenario • [   0% ] waiting  23.0s

running (0m13.0s), 20/40 VUs, 60 complete and 0 interrupted iterations
slow_scenario   [  43% ] 20 VUs   13.0s/30s
fast_scenario • [   0% ] waiting  22.0s

running (0m14.0s), 20/40 VUs, 61 complete and 0 interrupted iterations
slow_scenario   [  47% ] 20 VUs   14.0s/30s
fast_scenario • [   0% ] waiting  21.0s

running (0m15.0s), 20/40 VUs, 80 complete and 0 interrupted iterations
slow_scenario   [  50% ] 20 VUs   15.0s/30s
fast_scenario • [   0% ] waiting  20.0s

running (0m16.0s), 20/40 VUs, 80 complete and 0 interrupted iterations
slow_scenario   [  53% ] 20 VUs   16.0s/30s
fast_scenario • [   0% ] waiting  19.0s

running (0m17.0s), 20/40 VUs, 80 complete and 0 interrupted iterations
slow_scenario   [  57% ] 20 VUs   17.0s/30s
fast_scenario • [   0% ] waiting  18.0s

running (0m18.0s), 20/40 VUs, 81 complete and 0 interrupted iterations
slow_scenario   [  60% ] 20 VUs   18.0s/30s
fast_scenario • [   0% ] waiting  17.0s

running (0m19.0s), 20/40 VUs, 100 complete and 0 interrupted iterations
slow_scenario   [  63% ] 20 VUs   19.0s/30s
fast_scenario • [   0% ] waiting  16.0s

running (0m20.0s), 20/40 VUs, 100 complete and 0 interrupted iterations
slow_scenario   [  67% ] 20 VUs   20.0s/30s
fast_scenario • [   0% ] waiting  15.0s

running (0m21.0s), 20/40 VUs, 100 complete and 0 interrupted iterations
slow_scenario   [  70% ] 20 VUs   21.0s/30s
fast_scenario • [   0% ] waiting  14.0s

running (0m22.0s), 20/40 VUs, 111 complete and 0 interrupted iterations
slow_scenario   [  73% ] 20 VUs   22.0s/30s
fast_scenario • [   0% ] waiting  13.0s

running (0m23.0s), 20/40 VUs, 120 complete and 0 interrupted iterations
slow_scenario   [  77% ] 20 VUs   23.0s/30s
fast_scenario • [   0% ] waiting  12.0s

running (0m24.0s), 20/40 VUs, 120 complete and 0 interrupted iterations
slow_scenario   [  80% ] 20 VUs   24.0s/30s
fast_scenario • [   0% ] waiting  11.0s

running (0m25.0s), 20/40 VUs, 120 complete and 0 interrupted iterations
slow_scenario   [  83% ] 20 VUs   25.0s/30s
fast_scenario • [   0% ] waiting  10.0s

running (0m26.0s), 20/40 VUs, 140 complete and 0 interrupted iterations
slow_scenario   [  87% ] 20 VUs   26.0s/30s
fast_scenario • [   0% ] waiting  09.0s

running (0m27.0s), 20/40 VUs, 140 complete and 0 interrupted iterations
slow_scenario   [  90% ] 20 VUs   27.0s/30s
fast_scenario • [   0% ] waiting  08.0s

running (0m28.0s), 20/40 VUs, 140 complete and 0 interrupted iterations
slow_scenario   [  93% ] 20 VUs   28.0s/30s
fast_scenario • [   0% ] waiting  07.0s

running (0m29.0s), 20/40 VUs, 143 complete and 0 interrupted iterations
slow_scenario   [  97% ] 20 VUs   29.0s/30s
fast_scenario • [   0% ] waiting  06.0s

running (0m30.0s), 20/40 VUs, 160 complete and 0 interrupted iterations
slow_scenario   [ 100% ] 20 VUs   30.0s/30s
fast_scenario • [   0% ] waiting  05.0s

running (0m31.0s), 20/40 VUs, 160 complete and 0 interrupted iterations
slow_scenario ↓ [ 100% ] 20 VUs   30s
fast_scenario • [   0% ] waiting  04.0s

running (0m32.0s), 20/40 VUs, 160 complete and 0 interrupted iterations
slow_scenario ↓ [ 100% ] 20 VUs   30s
fast_scenario • [   0% ] waiting  03.0s

running (0m33.0s), 00/40 VUs, 180 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs   30s
fast_scenario • [   0% ] waiting  02.0s

running (0m34.0s), 00/40 VUs, 180 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs   30s
fast_scenario • [   0% ] waiting  01.0s

running (0m35.0s), 00/40 VUs, 180 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs   30s
fast_scenario • [   0% ] waiting  00.0s

running (0m36.0s), 20/40 VUs, 208 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [   3% ] 20 VUs  01.0s/30s

running (0m37.0s), 20/40 VUs, 253 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [   7% ] 20 VUs  02.0s/30s

running (0m38.0s), 20/40 VUs, 292 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  10% ] 20 VUs  03.0s/30s

running (0m39.0s), 20/40 VUs, 333 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  13% ] 20 VUs  04.0s/30s

running (0m40.0s), 20/40 VUs, 374 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  17% ] 20 VUs  05.0s/30s

running (0m41.0s), 20/40 VUs, 416 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  20% ] 20 VUs  06.0s/30s

running (0m42.0s), 20/40 VUs, 461 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  23% ] 20 VUs  07.0s/30s

running (0m43.0s), 20/40 VUs, 498 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  27% ] 20 VUs  08.0s/30s

running (0m44.0s), 20/40 VUs, 540 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  30% ] 20 VUs  09.0s/30s

running (0m45.0s), 20/40 VUs, 581 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  33% ] 20 VUs  10.0s/30s

running (0m46.0s), 20/40 VUs, 624 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  37% ] 20 VUs  11.0s/30s

running (0m47.0s), 20/40 VUs, 672 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  40% ] 20 VUs  12.0s/30s

running (0m48.0s), 20/40 VUs, 709 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  43% ] 20 VUs  13.0s/30s

running (0m49.0s), 20/40 VUs, 756 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  47% ] 20 VUs  14.0s/30s

running (0m50.0s), 20/40 VUs, 797 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  50% ] 20 VUs  15.0s/30s

running (0m51.0s), 20/40 VUs, 838 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  53% ] 20 VUs  16.0s/30s

running (0m52.0s), 20/40 VUs, 881 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  57% ] 20 VUs  17.0s/30s

running (0m53.0s), 20/40 VUs, 922 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  60% ] 20 VUs  18.0s/30s

running (0m54.0s), 20/40 VUs, 966 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  63% ] 20 VUs  19.0s/30s

running (0m55.0s), 20/40 VUs, 1005 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  67% ] 20 VUs  20.0s/30s

running (0m56.0s), 20/40 VUs, 1045 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  70% ] 20 VUs  21.0s/30s

running (0m57.0s), 20/40 VUs, 1087 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  73% ] 20 VUs  22.0s/30s

running (0m58.0s), 20/40 VUs, 1126 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  77% ] 20 VUs  23.0s/30s
fast_scenario   [  60% ] 20 VUs  18.0s/30s

running (0m54.0s), 20/40 VUs, 966 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  63% ] 20 VUs  19.0s/30s

running (0m55.0s), 20/40 VUs, 1005 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  67% ] 20 VUs  20.0s/30s

running (0m56.0s), 20/40 VUs, 1045 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  70% ] 20 VUs  21.0s/30s

running (0m57.0s), 20/40 VUs, 1087 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  73% ] 20 VUs  22.0s/30s

running (0m58.0s), 20/40 VUs, 1126 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  77% ] 20 VUs  23.0s/30s
fast_scenario   [  67% ] 20 VUs  20.0s/30s

running (0m56.0s), 20/40 VUs, 1045 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  70% ] 20 VUs  21.0s/30s

running (0m57.0s), 20/40 VUs, 1087 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  73% ] 20 VUs  22.0s/30s

running (0m58.0s), 20/40 VUs, 1126 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  77% ] 20 VUs  23.0s/30s

running (0m57.0s), 20/40 VUs, 1087 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  73% ] 20 VUs  22.0s/30s

running (0m58.0s), 20/40 VUs, 1126 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  77% ] 20 VUs  23.0s/30s
running (0m57.0s), 20/40 VUs, 1087 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  73% ] 20 VUs  22.0s/30s

running (0m58.0s), 20/40 VUs, 1126 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  77% ] 20 VUs  23.0s/30s
fast_scenario   [  73% ] 20 VUs  22.0s/30s

running (0m58.0s), 20/40 VUs, 1126 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  77% ] 20 VUs  23.0s/30s
running (0m58.0s), 20/40 VUs, 1126 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  77% ] 20 VUs  23.0s/30s
fast_scenario   [  77% ] 20 VUs  23.0s/30s

running (0m59.0s), 20/40 VUs, 1163 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  80% ] 20 VUs  24.0s/30s

slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  80% ] 20 VUs  24.0s/30s

fast_scenario   [  80% ] 20 VUs  24.0s/30s


running (1m00.0s), 20/40 VUs, 1203 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
running (1m00.0s), 20/40 VUs, 1203 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  83% ] 20 VUs  25.0s/30s

running (1m01.0s), 20/40 VUs, 1243 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  87% ] 20 VUs  26.0s/30s

running (1m02.0s), 20/40 VUs, 1277 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  90% ] 20 VUs  27.0s/30s

running (1m03.0s), 20/40 VUs, 1314 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  93% ] 20 VUs  28.0s/30s

running (1m04.0s), 20/40 VUs, 1356 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [  97% ] 20 VUs  29.0s/30s

running (1m05.0s), 20/40 VUs, 1398 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario   [ 100% ] 20 VUs  30.0s/30s
     ✓ slow: status 200
     ✓ slow: has quotes
     ✓ fast: status 200
     ✓ fast: has quotes

     checks.........................: 100.00% ✓ 2838      ✗ 0
     data_received..................: 4.0 MB  61 kB/s
     data_sent......................: 141 kB  2.2 kB/s
   ✗ fast_duration..................: avg=386.41ms min=223.16ms med=383.74ms max=739.33ms p(50)=383.74ms p(90)=455ms    p(95)=482.56ms p(99)=612.63ms
     http_req_blocked...............: avg=159.46µs min=0s       med=0s       max=11.99ms  p(50)=0s       p(90)=0s       p(95)=0s       p(99)=5.98ms  
     http_req_connecting............: avg=135.68µs min=0s       med=0s       max=11.99ms  p(50)=0s       p(90)=0s       p(95)=0s       p(99)=4.82ms  
     http_req_duration..............: avg=784.9ms  min=223.16ms med=392.04ms max=3.94s    p(50)=392.04ms p(90)=3.41s    p(95)=3.52s    p(99)=3.84s   
       { expected_response:true }...: avg=784.9ms  min=223.16ms med=392.04ms max=3.94s    p(50)=392.04ms p(90)=3.41s    p(95)=3.52s    p(99)=3.84s   
     http_req_failed................: 0.00%   ✓ 0         ✗ 1419
     http_req_receiving.............: avg=76.76ms  min=0s       med=86.06ms  max=309.06ms p(50)=86.06ms  p(90)=134.52ms p(95)=149.39ms p(99)=189.18ms
     http_req_sending...............: avg=24.94µs  min=0s       med=0s       max=4.5ms    p(50)=0s       p(90)=0s       p(95)=0s       p(99)=998.16µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(50)=0s       p(90)=0s       p(95)=0s       p(99)=0s
     http_req_waiting...............: avg=708.12ms min=178.76ms med=302.73ms max=3.94s    p(50)=302.73ms p(90)=3.4s     p(95)=3.51s    p(99)=3.77s   
     http_reqs......................: 1419    21.717851/s
     iteration_duration.............: avg=886.28ms min=323.96ms med=492.67ms max=4.05s    p(50)=492.67ms p(90)=3.51s    p(95)=3.62s    p(99)=3.94s   
     iterations.....................: 1419    21.717851/s
   ✗ slow_duration..................: avg=3.52s    min=3.22s    med=3.48s    max=3.94s    p(50)=3.48s    p(90)=3.8s     p(95)=3.91s    p(99)=3.94s   
     vus............................: 20      min=0       max=20
     vus_max........................: 40      min=40      max=40
══ Performance Comparison ══════════════════════════════
  Slow (N+1)   p50 : 3488.5 ms
  Slow (N+1)   p99 : 3947.3 ms
  Fast (batch) p50 : 383.7 ms
  Fast (batch) p99 : 612.6 ms
  p99 ratio (slow/fast) : 6.4×
════════════════════════════════════════════════════════

running (1m05.3s), 00/40 VUs, 1419 complete and 0 interrupted iterations
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario ✓ [ 100% ] 20 VUs  30s
time="2026-05-29T10:25:17+05:30" level=error msg="thresholds on metrics 'fast_duration, slow_duration' have been crossed"

Dell@DESKTOP-Q8REA6D MINGW64 /d/ThinkBridge/thinkschool/Day-11/piece-1 (main)
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario ✓ [ 100% ] 20 VUs  30s
slow_scenario ✓ [ 100% ] 20 VUs  30s
slow_scenario ✓ [ 100% ] 20 VUs  30s
fast_scenario ✓ [ 100% ] 20 VUs  30s
time="2026-05-29T10:25:17+05:30" level=error msg="thresholds on metrics 'fast_duration, slow_duration' have been crossed"

Dell@DESKTOP-Q8REA6D MINGW64 /d/ThinkBridge/thinkschool/Day-11/piece-1 (main)
$ url http://localhost:5075/api/collections/1/quotes/slow
bash: url: command not found

Dell@DESKTOP-Q8REA6D MINGW64 /d/ThinkBridge/thinkschool/Day-11/piece-1 (main)
$ http://localhost:5075/api/collections/1/quotes/slow                                                                                          
bash: http://localhost:5075/api/collections/1/quotes/slow: No such file or directory

Dell@DESKTOP-Q8REA6D MINGW64 /d/ThinkBridge/thinkschool/Day-11/piece-1 (main)
$ curl http://localhost:5075/api/collections/1/quotes/slow
{"collectionId":1,"name":"PerfCollection-1","quotes":[{"id":1,"author":"Marcus Aurelius","text":"The impediment to action advances action.","createdAt":"2026-05-29T04:42:20.0087446"},{"id":2,"author":"Marcus Aurelius","text":"The virtue of the wise is the courage of all men.","createdAt":"2026-05-29T04:42:20.2114562"},{"id":3,"author":"Seneca","text":"In the middle of courage lies love.","createdAt":"2026-05-29T04:42:20.2114578"},{"id":4,"author":"Epictetus","text":"To know freedom is to know knowledge.","createdAt":"2026-05-29T04:42:20.2114583"},{"id":5,"author":"Aristotle","text":"The measure of a man is what he does with reason.","createdAt":"2026-05-29T04:42:20.2114587"},{"id":6,"author":"Plato","text":"He who has a freedom to live can bear almost any reason.","createdAt":"2026-05-29T04:42:20.2114592"},{"id":7,"author":"Socrates","text":"The 
unexamined knowledge is not worth knowledge.","createdAt":"2026-05-29T04:42:20.2114597"},{"id":8,"author":"Nietzsche","text":"We are what we repeatedly love. Excellence then is a truth.","createdAt":"2026-05-29T04:42:20.2114601"},{"id":9,"author":"Immanuel Kant","text":"Simplicity is the justice of sophistication.","createdAt":"2026-05-29T04:42:20.2114605"},{"id":10,"author":"René Descartes","text":"Not all those who love are lost.","createdAt":"2026-05-29T04:42:20.2114619"},{"id":11,"author":"Voltaire","text":"Knowing yourself is the beginning of all strength.","createdAt":"2026-05-29T04:42:20.2114624"},{"id":12,"author":"Albert Einstein","text":"The justice of the wise is the freedom of all men.","createdAt":"2026-05-29T04:42:20.2114628"},{"id":13,"author":"Feynman","text":"In the middle of courage lies virtue.","createdAt":"2026-05-29T04:42:20.2114632"},{"id":14,"author":"Carl Sagan","text":"To know strength is to know love.","createdAt":"2026-05-29T04:42:20.2114637"},{"id":15,"author":"Hawking","text":"The measure of a man is what he does with wisdom.","createdAt":"2026-05-29T04:42:20.2114647"},{"id":16,"author":"Marie Curie","text":"He who has a freedom to live can bear almost any hope.","createdAt":"2026-05-29T04:42:20.2114657"},{"id":17,"author":"Tolstoy","text":"The unexamined virtue is not worth love.","createdAt":"2026-05-29T04:42:20.2114662"},{"id":18,"author":"Dostoevsky","text":"We are what we 
repeatedly freedom. Excellence then is a wisdom.","createdAt":"2026-05-29T04:42:20.2114666"},{"id":19,"author":"Victor Hugo","text":"Simplicity is the truth of sophistication.","createdAt":"2026-05-29T04:42:20.211467"},{"id":20,"author":"Hemingway","text":"Not all those who strength are lost.","createdAt":"2026-05-29T04:42:20.2114674"}]}